In [1]:
# Increase Jupyter display cell-width
from IPython.core.display import display, HTML
display(HTML("<style>.container { width:75% !important; }</style>"))

## Directions for running SQL in Jupyter

In [2]:
# Import libraries
import pandas as pd
import sqlite3
import sql

In [3]:
# We will sqlite3 library and create a connection
cnn = sqlite3.connect('jupyter_sql_tutorial.db')

In [4]:
# Load the SQL module to iPython
%load_ext sql

In [5]:
%sql sqlite:///jupyter_sql_tutorial.db

# <span style="color:orange"><b>Update Sheborgs <i>daily</i></b>!</span>

In [14]:
# %%sql

# INSERT INTO sheborgs
# VALUES (6, 'Freya', 121, 'Saturns Children', 8.5, 2008, NULL, NULL)

 * sqlite:///jupyter_sql_tutorial.db
1 rows affected.

[]

In [29]:
# %%sql

# ALTER TABLE sheborgs
# ADD Notes;

In [40]:
# %%sql

# UPDATE sheborgs
# SET gross = 36900000
# WHERE name = 'Ada';

 * sqlite:///jupyter_sql_tutorial.db
1 rows affected.

[]

In [41]:
%%sql

SELECT *
FROM sheborgs;

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(0, 'Alita', 18, 'Zalem', 8, 2019, 200000000, 404000000, None),
 (1, 'Cortana', 21, 'Halo', 9, 2001, None, None, None),
 (2, 'Major', 35, 'Ghost in the Shell', 10, 1989, 110000000, 169800000, None),
 (3, 'Seven of Nine', 24, 'Voyager', 9.5, 1997, None, None, None),
 (4, 'Pris', 3.75, 'Blade Runner', 8, 1982, 30000000, 41500000, None),
 (5, 'Ada', 1, 'Ex Machina', 8, 2014, 15000000, 36900000, None),
 (6, 'Freya', 121, 'Saturns Children', 8.5, 2008, None, None, None)]

## Intro to INNER JOIN

In [9]:
%%sql

SELECT p1.country, p1.continent,
    prime_minister, president
FROM prime_ministers as p1
INNER JOIN presidents as p2
ON p1.country = p2.country;

 * sqlite:///jupyter_sql_tutorial.db
(sqlite3.OperationalError) no such table: prime_ministers
[SQL: SELECT p1.country, p1.continent, prime_minister, president
FROM prime_ministers as p1
INNER JOIN presidents as p2
ON p1.country = p2.country;]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [44]:
%%sql

SELECT name AS city, name AS country
FROM cities
INNER JOIN countries
ON cities.country_code = countries.code;

 * sqlite:///jupyter_sql_tutorial.db
(sqlite3.OperationalError) no such table: cities
[SQL: SELECT name AS city, name AS country
FROM cities
INNER JOIN countries
ON cities.country_code = countries.code;]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [45]:
%%sql

SELECT c1.name AS city, c2.name AS country, c2.region
FROM cities AS c1
INNER JOIN countries c2
ON c1.country_code = c2.code;

 * sqlite:///jupyter_sql_tutorial.db
(sqlite3.OperationalError) no such table: cities
[SQL: SELECT c1.name AS city, c2.name AS country, c2.region
FROM cities AS c1
INNER JOIN countries c2
ON c1.country_code = c2.code;]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [46]:
%%sql

SELECT c.code AS country_code, name, year, inflation_rate
FROM countries AS c
INNER JOIN economies AS e
ON c.code = e.code;

 * sqlite:///jupyter_sql_tutorial.db
(sqlite3.OperationalError) no such table: countries
[SQL: SELECT c.code AS country_code, name, year, inflation_rate
FROM countries AS c
INNER JOIN economies AS e
ON c.code = e.code;]
(Background on this error at: http://sqlalche.me/e/e3q8)

#### EX:
SELECT *
<br>FROM left_table
<br>INNER JOIN right_table
<br>ON left_table.id = right_table.id
<br>INNER JOIN another_table
<br>ON left_table.id = another_table.id;

In [47]:
%%sql

SELECT c.code, name, region, e.year, fertility_rate, unemployment_rate
FROM countries AS c
INNER JOIN populations AS p
ON c.code = p.country_code
INNER JOIN economies AS e
ON c.code = e.code
AND e.year = p.year;

 * sqlite:///jupyter_sql_tutorial.db
(sqlite3.OperationalError) no such table: countries
[SQL: SELECT c.code, name, region, e.year, fertility_rate, unemployment_rate
FROM countries AS c
INNER JOIN populations AS p
ON c.code = p.country_code
INNER JOIN economies AS e
ON c.code = e.code
AND e.year = p.year;]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [48]:
%%sql 

SELECT c.name AS country, c.continent, l.name AS language, l.official
FROM countries AS c
INNER JOIN languages AS l
USING (code);

 * sqlite:///jupyter_sql_tutorial.db
(sqlite3.OperationalError) no such table: countries
[SQL: SELECT c.name AS country, c.continent, l.name AS language, l.official
FROM countries AS c
INNER JOIN languages AS l
USING (code);]
(Background on this error at: http://sqlalche.me/e/e3q8)

## Self-join

In [49]:
# -- Select fields with aliases
# SELECT p1.country_code,
#        p1.size AS size2010,
#        p2.size AS size2015
# -- From populations (alias as p1)
# FROM populations as p1
#   -- Join to itself (alias as p2)
#   INNER JOIN populations as p2
#     -- Match on country code
#     ON p1.country_code = p2.country_code
#         -- and year (with calculation)
#         AND p2.year - 5 = p1.year;

In [ ]:
# %%sql

# -- Select fields with aliases
# SELECT p1.country_code,
#        p1.size AS size2010, 
#        p2.size AS size2015,
#        -- Calculate growth_perc
#        ((p2.size - p1.size)/p1.size * 100.0) AS growth_perc
# -- From populations (alias as p1)
# FROM populations AS p1
#   -- Join to itself (alias as p2)
#   INNER JOIN populations AS p2
#     -- Match on country code
#     ON p1.country_code = p2.country_code
#         -- and year (with calculation)
#         AND p1.year = p2.year - 5;

## Case when and then

In [50]:
# %%sql

# SELECT name, continent, code, surface_area,
#     -- First case
#     CASE WHEN surface_area > 2000000 THEN 'large'
#         -- Second case
#         WHEN surface_area > 350000 THEN 'medium'
#         -- Else clause + end
#         ELSE 'small' END
#         -- Alias name
#         AS geosize_group
# -- From table
# FROM countries;

In [51]:
# %%sql

# SELECT country_code, size,
#     -- First case
#     CASE WHEN size > 50000000 THEN 'large'
#         -- Second case
#         WHEN size > 1000000 THEN 'medium'
#         -- Else clause + end
#         ELSE 'small' END
#         -- Alias name (popsize_group)
#         AS popsize_group
# -- From table
# FROM populations
# -- Focus on 2015
# WHERE year = 2015;

In [ ]:
# %%sql

# SELECT country_code, size,
#     CASE WHEN size > 50000000 THEN 'large'
#         WHEN size > 1000000 THEN 'medium'
#         ELSE 'small' END
#         AS popsize_group
# -- Into table
# INTO pop_plus
# FROM populations
# WHERE year = 2015;

# -- Select all columns of pop_plus
# SELECT *
# FROM pop_plus;

In [ ]:
# %%sql

# SELECT country_code, size,
#   CASE WHEN size > 50000000
#             THEN 'large'
#        WHEN size > 1000000
#             THEN 'medium'
#        ELSE 'small' END
#        AS popsize_group
# INTO pop_plus       
# FROM populations
# WHERE year = 2015;

# -- Select fields
# SELECT name, continent, geosize_group, popsize_group
# -- From countries_plus (alias as c)
# FROM countries_plus AS c
#   -- Join to pop_plus (alias as p)
#   INNER JOIN pop_plus as p
#     -- Match on country code
#     ON c.code = p.country_code
# -- Order the table    
# ORDER BY geosize_group;